sa66ath/MPLABXProjects/FT817_BANDCTL_FC757AT_PIC16F1827/adc.c
#include <xc.h>         /* XC8 General Include File */

#include <stdint.h>        /* For uint8_t definition */

#include "system.h"
#include "adc.h"

/*----------------------------------------------------------------------*/
#define ADC_CH  0b01010     // 01010 = AN10 
#define FVR_CH  0b11111     // 11111 =FVR (Fixed Voltage Reference) Buffer 1 Output

uint16_t adcData;
uint16_t fvrData;


/*----------------------------------------------------------------------*/
void FVRInit(void)
{
    FVRCON = 0b11<<_FVRCON_ADFVR_POSITION |     // 11 = ADC Fixed Voltage Reference Peripheral output is 4x (4.096V)
           0b00<<_FVRCON_CDAFVR_POSITION |      // 00 = Comparator and DAC Fixed Voltage Reference Peripheral output is off. 
           1<<_FVRCON_FVREN_POSITION;           // 1 = Fixed Voltage Reference is enabled

    while(!FVRRDY)   { ; }               // 1 = Fixed Voltage Reference output is ready for use
}

static void AdcTimerInit(void)
{
    T4CON = 0b0011<<_T4CON_T4OUTPS_POSITION |   // 0011 = 1:4 Postscaler
                 0<<_T4CON_TMR4ON_POSN |        // 0 = Timerx is off
              0b10<<_T4CON_T4CKPS_POSITION;     // Prescaler is 16
    PR4 = (uint8_t)(FCY/4/16*0.01);     // FCY/Postscaler/Prescaler*sec

    TMR4IF = 0;
    TMR4IE = 0;
}


void AdcInit(void)
{
    ADCON0 = ADC_CH<<_ADCON0_CHS_POSITION |
             1<<_ADCON0_ADON_POSITION;      // 1 = ADC is enabled

    ADCON1 = 0<<_ADCON1_ADFM_POSITION |     // 0 = Left justified. Six Least Significant bits of ADRESL are set to ?0? when the conversion result is loaded.
            0b001<<_ADCON1_ADCS_POSITION |  // 001 = FOSC/8
            0<<_ADCON1_ADNREF_POSITION |    // 0 = VREF- is connected to AVSS
            0b00<<_ADCON1_ADPREF_POSITION;  // 00 = VREF+ is connected to AVDD

    AdcTimerInit();
    
    ADIE = 1;  
    TMR4IE = 1;
}

void AdcStart(void)
{
    TMR4ON = 1;
}

uint16_t AdcRead(void)
{
    uint32_t tmp;

    ADIE = 0;
    tmp = (uint32_t)adcData<<16; 
    tmp /= (fvrData)? fvrData:0x0001;
    ADIE = 1;

    tmp = (UINT16_MAX < tmp)? UINT16_MAX:tmp;

    return tmp;
}

void AdcIsr(void)
{
    uint16_t data = ADRESH<<8 | ADRESL;
    switch(ADCON0bits.CHS) {
        case FVR_CH:
            fvrData = data;
            ADCON0bits.CHS = ADC_CH;
            break;
        case ADC_CH:
        default:
            adcData = data;
            ADCON0bits.CHS = FVR_CH;
            break;
    }
}
